vm-fedora/emacs/configuration.org
*** Org mode edit src in current window

When pressing =C-c '= inside the code block, which way I prefer to open the src editing window: ~current-window~

#+BEGIN_SRC emacs-lisp
  (setq org-src-window-setup 'current-window)
  ;; (setq org-src-window-setup 'split-window-rIght)
#+END_SRC

Inside the src editing window, press =C-c '= again to accept change and exit; press ~C-c C-k~ to abort and exit.


*** Enable auto pair mode

Auto pair =()= and =[]=

#+BEGIN_SRC emacs-lisp
  (electric-pair-mode)
#+END_SRC


*** Disable native compilation warnings and errors

Auto pair =()= and =[]=

#+BEGIN_SRC emacs-lisp
  (setq native-comp-async-report-warnings-errors nil)
#+END_SRC



*** Don't use actual image size for inline images and show inline image by default

#+BEGIN_SRC emacs-lisp
  (setq org-image-actual-width nil)
  (setq org-startup-with-inline-images t)
#+END_SRC

After you set ~org-image-actual-width~ to ~nil~, then you're able to use the following attributes to specific the size of any inline images:

#+BEGIN_SRC emacs-lisp :tangle no
  ;;
  ;; Display image with half of the current window size
  ;;
  #+ATTR_HTML: :width 50%
  [[~/...your_image_file]]

  ;;
  ;; Display image with exactly pixels width
  ;;
  #+ATTR_HTML: :width 100px
  [[~/...your_image_file]]
#+END_SRC

Because you set ~org-startup-with-inline-images~, that's why sometimes the size doesn't work well when opening an org file in a separated window (it still use the full Emacs window width to display the inline image)!!!

The way to fix that is by running ~org-toggle-inline-images~ twice to refresh it.


*** Add extra module load path

Load your custom dynamically loaded module from the given path.

#+BEGIN_SRC emacs-lisp
  ;; Just for debugging purpose:
  ;;
  ;; When developing your dynamically Loaded Module for emacs, you can
  ;; add your library output folder to the 'load-path' for testing.
  ;;
  ;; After adding your testing library folder to 'load-path', then you
  ;; can load it by running:
  ;; 
  ;; (require 'YOUR_LIB_FILENAME_HERE)
  ;; (CALL_YOUR_MODULE_FUNCTION)
  ;; ...
  ;;
  (push (expand-file-name "~/zig/emacs-module-in-zig/zig-out/lib") load-path)

  (push "~/.config/emacs/lib" load-path)
#+END_SRC



** Set fonts and transparent background, it has to be in ~early-init.el~

For some setttings, you have to place them into the =early-init.el=

For example, I need to run some functions to set transparent background via the ~after-make-frame-functions~ hook. If you run ~describe-variable~ on that hook, you should see it says:

=="Note that these functions are usually not run for the initial frame, unless you add them to the hook in your early-init file."=

That's why the following code has to be placed into =early-init.el= instead of =init.el=!!!

#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  ;; --------------------------------------------------------------------------------------------
  ;; Remove title bar for the Mac (GUI) version
  ;; --------------------------------------------------------------------------------------------
  ;;  (if (string-equal "darwin" system-type)
  ;;       (progn
  ;;           ;;
  ;;           ;; By setting this, you don't need to figure out it's the terminal version or GUI version.
  ;;           ;;
  ;;           (add-to-list 'default-frame-alist '(undecorated . t))
  ;;           (message ">>> Remove title bar for Mac GUI version.")
  ;;       )
  ;;  )

  ;; --------------------------------------------------------------------------------------------
  ;; Set font and transparent after creating the frame (window)
  ;; --------------------------------------------------------------------------------------------

  ;;
  ;; Set my font
  ;;
  (defun my-set-font()
     (set-face-attribute 'default nil
         ;;:family "SauceCodePro Nerd Font"
         :family "JetBrains Mono Nerd Font"
         :weight 'semi-bold
         :height 140
         ;; :italic t
     )
     (message ">>> [ early-init > my-set-font ] Set my custom font.")
  )

  ;;
  ;; Set transparent background for GUI
  ;;
  (defun my-set-transparent-gui()
    (message ">>> [ early-init > my-set-transarent-background ] - call 'my-set-transparent-gui'")
    ;;
    ;; Force to set a particular background color for better transparent effect.
    ;;
    ;; (set-face-attribute 'default nil :background "#23211B")

    (set-frame-parameter nil 'alpha-background 95)
    (add-to-list 'default-frame-alist '(alpha-background . 95))
  )

  ;;
  ;; Set transparent background for terminal
  ;;
  (defun my-set-transparent-terminal()
    (message ">>> [ early-init > my-set-transarent-background ] - call 'my-set-transparent-terminal'")
    (set-face-attribute 'default nil :background "nil")
  )

  ;;
  ;; Setting the transparent background is very different between GUI mode and Terminal mode, so you
  ;; better do that in the a hook handler (especially after the init window frame has been created
  ;; and the color theme has been loaded)
  ;;
  ;; For detailed steps about =Emacs= startup sequence, read this:
  ;;
  ;; https://www.gnu.org/software/emacs/manual/html_node/elisp/Startup-Summary.html
  ;;
  (defun my-set-transarent-background(current_frame)
    (message ">>> [ early-init > my-set-transarent-background ] - display-graphics-p result: %s" (display-graphic-p current_frame))
    (if (display-graphic-p current_frame)
            (my-set-transparent-gui)
            (my-set-transparent-terminal)
    )
  )

  ;;
  ;; Call set font function and set transparent function in standalone mode or daemon mode
  ;;
  (if (daemonp)
      (add-hook 'after-make-frame-functions
          (lambda (frame)
              (with-selected-frame frame
                (message ">>> [ early-init ] Run lambda funtion in 'after-make-frame-functions' hook.")
                (progn
                    (message ">>> [ early-init ] lambda funtion set font and transparent background in 'after-make-frame-functions' hook.")
                    (my-set-font)
                    (my-set-transarent-background frame)
                )
                (message ">>> [ early-init ] Run lambda funtion in 'after-make-frame-functions' hook [ done ].")
                            ))
          )
      (add-hook 'emacs-startup-hook
          (lambda ()
              (message ">>> [ early-init ] Run lambda funtion in 'emacs-startup-hook' hook.")
              (progn
                  (message ">>> [ early-init ] lambda funtion set font and transparent background in 'emacs-startup-hook' hook.")
                  (my-set-font)
                  (my-set-transarent-background nil)
              )
              (message ">>> [ early-init ] Run lambda funtion in 'emacs-startup-hook' hook [ done ].")
          )
          )
  )
#+END_SRC


** Package init and settings

*** Init package and install =use-package=

#+BEGIN_SRC emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  ;;(add-to-list 'package-archives
  ;;	     '(
  ;;	       ("melpa" . "https://melpa.org/packages/")
  ;;	       ("org" . "https://orgmode.org/elpa/")
  ;;	       ("elpa" . "https://elpa.gun.org/packages/")
  ;;	       ))

  (unless package-archives
          (package-refresh-contents))
  ;;(package-refresh-contents)
  (package-initialize)

  ;;
  ;; (unless condition nil
  ;;         statement-to-execute)
  ;;
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)

  ;; Auto install all missing packages when using =(use-packge)`
  ;; It's equal to use `:ensure t` in `(use-package)`
  (setq use-package-always-ensure t)
#+END_SRC



*** ~(use-package)~ quick manual

#+begin_src emacs-lisp :tangle no
  ;;
  ;; Load the package, but only if 'PACKAGE_NAME' is available on your system. If not, a
  ;; warning is logged to the '*Messages*' buffer.
  ;;
  ;;
  (use-package 'PACKAGE_NAME
    ;;
    ;; Install if it doesn't exists, and because of '(setq use-package-always-ensure t)'
    ;; has been set already, that said ':ensure t' will be applied to all '(use-package)',
    ;; that's why you don't need to set ':ensure t' anymore.
    ;;
    :ensure t

    ;; 
    ;; Lazy load this package
    ;; Using 'bind' and 'command' will cause the package to lazy load as well!!!
    ;;
    ;; The keywords ':commands,' et al, provide "triggers" that cause a package to
    ;; be loaded when certain events occur. However, if 'use-package' cannot determine
    ;; that any trigger has been declared, it will load the package immediately (when
    ;; Emacs is starting up) unless :defer t is given. The presence of triggers can be
    ;; overridden using ':demand t' to force immediately loading anyway.
    ;; For example, :hook represents a trigger that fires when the specified hook is run.
    ;; 
    ;; In almost all cases you don't need to manually specify ':defer t', because this is
    ;; implied whenever ':bind' or ':mode' or ':interpreter' are used. Typically, you only
    ;; need to specify ':defer' if you know for a fact that some other package will do
    ;; something to cause your package to load at the appropriate time, and thus you would
    ;;  like to defer loading even though 'use-package' has not created any autoloads for you.
    ;;
    :defer t

    ;; 
    ;; Use the ':init' keyword to execute code before a package is loaded. It accepts one
    ;; or more forms, up to the next keyword:
    ;;
    :init
        ;;
        ;; All settings belong to ':init' part
        ;;
        (setq YOUR_VARS t)

    ;; 
    ;; Use the ':config' keyword to execute code after a package is loaded. In cases where
    ;; loading is done lazily (see more about autoloading below), this execution is deferred
    ;; until after the autoload occurs
    :config
        ;;
        ;; All settings belong to ':config part
        ;;
        (your-mode t)

    ;; 
    ;; Load this package after another package
    ;;
    :after ANOTHER_PACKAGE_NAME

    ;; 
    ;; Run the commands when the package is actually loaded.
    ;; The ':commands' keyword takes either a symbol or a list of symbols.
    ;;
    :commands SINGLE_COMMAND
    :commands (COMMAND_1 COMMAND_2 COMMAND_3 etc)

    ;; 
    ;; Keybindings
    ;;
    :bind (("M-o l" . COMMAND_TO_BIND)
           ("M-o r" . COMMAND_TO_BIND)
           ("M-o w" . COMMAND_TO_BIND)))

    ;; 
    ;; The ':hook' keyword allows adding functions onto package hooks. The same
    ;; effect with using '(add-hook)'. The following ':hook' setting is the same:
    ;;
    ;; :init
    ;; (add-hook 'prog-mode-hook #'company-mode))
    ;;
    :hook (prog-mode . company-mode))

    ;; 
    ;; The ':custom' keyword allows customization of package custom variables.
    ;; Same thing with using '(setq NAME VALUE)' in ':init' but with comments.
    ;; The documentation string is not mandatory.
    ;;
    ;; NOTE: these are only for people who wish to keep customizations with their
    ;;       accompanying use-package declarations. Functionally, the only benefit
    ;;       over using setq in a :config block is that customizations might execute
    ;;       code when values are assigned.
    ;; 
    ;; NOTE: The customized values are not saved in the Emacs custom-file. Thus you
    ;;       should either use the :custom option or you should use M-x customize-option
    ;;       which will save customized values in the Emacs custom-file. Do not use both.
    ;;
    :custom
        (comint-buffer-maximum-size 20000 "Increase comint buffer size.")
        (comint-prompt-read-only t "Make the prompt read only."))
    ;;
    ;; The ':disabled' keyword can turn off a module you're having difficulties with, or
    ;; stop loading something you're not using at the present time:
    ;;
    :disabled

    ;;
    ;; Print out the error if you want
    ;;
    :catch (lambda (keyword err)
            (message ">>> Package load failed with error: %s" (error-message-string err)))

  )
#+end_src


** Enable system clipboard

 #+begin_src emacs-lisp
   (use-package xclip
      :config
          (xclip-mode 1)
   )
 #+end_src


